PC2/Parte2/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "as"], ["rating", ""], ["description", ""], ["release_date", nil], ["created_at", "2023-10-11 21:37:18.683419"], ["updated_at", "2023-10-11 21:37:18.683419"]]

    def set_movie
      begin
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]