PC4/Pregunta 4/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    #@movies = Movie.order(:title)
    @movies = Movie.all.sort_by { |movie| movie.title }