Rails-Avanzado/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars 2"], ["release_date", "1977-04-07 00:00:00"], ["updated_at", "2023-11-15 04:00:26.571997"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    if @movie.update(movie_params)